// Задача 38: Задайте массив вещественных чисел. Найдите разницу между максимальным и минимальным элементов массива.
// [3.22, 4.2, 1.15, 77.15, 65.2] => 77.15 - 1.15 = 76
// Random rand = new Random();
// double number = Math.Round(rand.Next(0,10) + rand.NextDouble(), 3);
// System.Console.WriteLine(number);
